semestr1/logika/09.11.20-w.md

# Table of Contents

1.  [Logika](#orgb680808)
    1.  [dziedziny logiki](#org8aaf0f6)
2.  [rodzaje logiki](#org9133892)
3.  [Arystoteles](#org308cdc5)

x#+TITLE: 09 11 20 W


<a id="orgb680808"></a>

# Logika

-   logika - zasada jasnego, poprawnego wyrażania myśli

-   psychologizm w logice -

-   czynnosc i wytwór

-   wg antypsychologistów logika zajmuje się obiektywnymi relacjami między wypowiedziami

-   logika zajmuje sie tym, jak powinno sie myślec i wyrażac te mysli


<a id="org8aaf0f6"></a>

## dziedziny logiki

-   semiotyka - nauka o języku, traktuje język jako środek formułowania i wyrażania myśli
    -   semantyka
    -   pragmatyka
    -   syntakstyka (synonimicznośc)
-   logika formalna - prawa logiki formalnej nie sa wyprowadzane z jezyka potocznego
-   metodologia nauk
-   teoria argumentacji- jej przedmiotem sa dyskursywne srodki przekonywania


<a id="org9133892"></a>

# rodzaje logiki

-   logika dialogowa - dialog proponenta i oponenta
-   logika modalna - funktory modalne dotyczą konieczności
-   logika dwuwartościowa
-   logiki wielowartościowe
-   logika matematyczna - pierwsze 30 lat 20 w.

-   metoda empiryczna (aposteriorycznym)- na podstawie doswiadczenia
-   metoda dedukcyjna (aprioryczne) -


<a id="org308cdc5"></a>

# Arystoteles

-   wnioskowanie bezpośrednie
-   wnioskowanie pośrednie (sylogizm)
-   elementy logiki modalnej

